---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.UnjoinOnEditWallChange
source: html/4082fb47-53bd-435a-9ef4-b7a847dc1072.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.UnjoinOnEditWallChange Property

Line associated with a joined face has been moved. This action will cause the other walls to become disjoined from this face. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId UnjoinOnEditWallChange { get; }
```